Tekla Open API Reference for Tekla Structures 2025
AngleDimension.GetDimensionSet Method
Overload List
Name | Description
GetDimensionSet()
 The angle dimension doesn't have a dimension set.
 (Overrides DimensionBase.GetDimensionSet().)
GetDimensionSet(Boolean)
 The angle dimension doesn't have a dimension set.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
Top
See Also
Reference
AngleDimension Class
Tekla.Structures.Drawing Namespace